lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  void beginCentralSyncProcedure() {
    if (central_sync_procedure_depth_ < 0xFFU) {
      ++central_sync_procedure_depth_;
    }
  }

  void endCentralSyncProcedure() {
    if (central_sync_procedure_depth_ > 0U) {
      --central_sync_procedure_depth_;
    }
  }

  bool centralSyncProcedureActive() const { return central_sync_procedure_depth_ != 0U; }

  void clearCentralScannerTransientState() {
    pending_connect_valid_ = false;
    pending_connect_channel_valid_ = false;
    pending_connect_report_us_ = 0U;
    scan_report_channel_valid_ = false;
    last_connect_attempt_ms_ = 0UL;
  }

  bool stopScanner() {
    const bool wasActive = Bluefruit.Scanner.running_ ||
                           Bluefruit.Scanner.paused_ ||
                           pending_connect_valid_;
    Bluefruit.Scanner.running_ = false;
    Bluefruit.Scanner.paused_ = false;
    Bluefruit.Scanner.timeout_s_ = 0U;
    clearCentralScannerTransientState();
    if (scan_prewarm_active_ && !radio_.isConnected()) {
      radio_.endForegroundUnconnectedRadioActivity();
      scan_prewarm_active_ = false;
    }
    nrf54l15_ble_idle_wake_cancel();
    armed_scan_wake_us_ = 0U;
    next_scan_due_us_ = 0U;
    return wasActive;
  }

  void resetScannerSchedule() {
    if (scan_prewarm_active_ && !radio_.isConnected()) {
      radio_.endForegroundUnconnectedRadioActivity();
      scan_prewarm_active_ = false;
    }
    nrf54l15_ble_idle_wake_cancel();
    armed_scan_wake_us_ = 0U;
    next_scan_due_us_ = 0U;
  }

  bool deferConnectionPhyRequest(uint8_t phy) {
    if (!radio_.isConnected()) {
      return false;
    }
    const uint8_t normalized = normalizeBluefruitPhy(phy);
    if (normalized == BLE_GAP_PHY_AUTO) {
      return false;
    }
    deferred_connection_requested_phy_ = normalized;
    deferred_connection_phy_request_pending_ = true;
    deferred_connection_phy_attempts_ = 0U;
    deferred_connection_phy_next_ms_ =
        millis() + kDeferredPhyRequestInitialDelayMs;
    return true;
  }

  bool deferConnectionDataLengthUpdate() {
    if (!radio_.isConnected()) {
      return false;
    }
    deferred_connection_data_length_request_pending_ = true;
    deferred_connection_data_length_attempts_ = 0U;
    deferred_connection_data_length_next_ms_ =
        millis() + kDeferredLinkRequestInitialDelayMs;
    return true;
  }

  bool deferConnectionMtuExchange(uint16_t mtu) {
    if (!radio_.isConnected()) {
      return false;
    }
    if (mtu < kDefaultAttMtu) {
      mtu = kDefaultAttMtu;
    }
    deferred_connection_requested_mtu_ = mtu;
    deferred_connection_mtu_request_pending_ = true;
    deferred_connection_mtu_attempts_ = 0U;
    deferred_connection_mtu_next_ms_ =
        millis() + kDeferredLinkRequestInitialDelayMs;
    return true;
  }

  void noteExplicitDataLengthRequest() {
    if (!radio_.isConnected()) {
      return;
    }
    const BleConnectionRole role = radio_.connectionRole();
    if (role == BleConnectionRole::kCentral) {
      central_explicit_data_length_request_ = true;
      radio_.setCentralPreferredDataLength(251U);
    } else if (role == BleConnectionRole::kPeripheral) {
      radio_.setPeripheralPreferredDataLength(251U);
    }
  }

  void noteExplicitCentralMtuRequest(uint16_t mtu) {
    if (!radio_.isConnected() ||
        radio_.connectionRole() != BleConnectionRole::kCentral) {
      return;
    }
    if (mtu < kDefaultAttMtu) {
      mtu = kDefaultAttMtu;
    } else if (mtu > 247U) {
      mtu = 247U;
    }
    central_explicit_mtu_request_valid_ = true;
    central_explicit_requested_mtu_ = mtu;
  }

  uint16_t centralAutomaticMtuCeiling() const {
    uint16_t mtu = central_explicit_mtu_request_valid_
                       ? central_explicit_requested_mtu_
                       : Bluefruit.central_requested_mtu_;
    if (mtu < kDefaultAttMtu) {
      mtu = kDefaultAttMtu;
    } else if (mtu > 247U) {
      mtu = 247U;
    }
    return mtu;
  }

  uint16_t centralAutomaticDataLengthCeiling() const {
    if (central_explicit_data_length_request_) {
      return 251U;
    }
    return preferredBleDataLengthFromMtu(centralAutomaticMtuCeiling());
  }

  bool registerCharacteristic(BLECharacteristic* characteristic) {
    if (characteristic == nullptr || characteristic_count_ >= kMaxCharacteristics) {
      return false;
    }
    characteristics_[characteristic_count_++] = characteristic;
    return true;
  }

  bool registerClientCharacteristic(BLEClientCharacteristic* characteristic) {
    if (characteristic == nullptr) {
      return false;
    }
    for (uint8_t i = 0U; i < client_characteristic_count_; ++i) {
      if (client_characteristics_[i] == characteristic) {
        return true;
      }
    }
    if (client_characteristic_count_ >= kMaxClientCharacteristics) {
      return false;
    }
    client_characteristics_[client_characteristic_count_++] = characteristic;
    return true;
  }

  void markAdvertisingDirty() {
    Bluefruit.Advertising.dirty_ = true;
    Bluefruit.ScanResponse.dirty_ = true;
  }

  void advertisingStarted() {
    adv_started_ms_ = schedulerTimeMs();
    next_adv_due_us_ = 0U;
    nrf54l15_ble_idle_wake_cancel();
    armed_adv_wake_us_ = 0U;
    nrf54l15_ble_background_radio_release();
    adv_random_state_ = 0U;
  }

  BLEConnection* connection() { return &connection_; }

  bool startRssiMonitor(uint8_t threshold) {
    if (!radio_.isConnected()) {
      return false;
    }
    rssi_monitor_enabled_ = true;
    rssi_monitor_threshold_ = threshold;
    last_reported_rssi_valid_ = radio_.getLatestConnectionRssiDbm(&last_reported_rssi_dbm_);
    return true;
  }

  int8_t currentConnectionRssi() const {
    int8_t rssiDbm = 0;
    if (!radio_.getLatestConnectionRssiDbm(&rssiDbm)) {
      return 0;
    }
    return rssiDbm;
  }

  bool queueCentralConnect(const ble_gap_evt_adv_report_t* report) {
    if (report == nullptr) {
      return false;
    }
    memcpy(pending_connect_address_, report->peer_addr.addr, sizeof(pending_connect_address_));
    pending_connect_channel_valid_ = scan_report_channel_valid_;
    if (pending_connect_channel_valid_) {
      pending_connect_channel_ = scan_report_channel_;
    }
    pending_connect_report_us_ = schedulerTimeUs();
    pending_connect_random_ =
        (report->peer_addr.addr_type != BLE_GAP_ADDR_TYPE_PUBLIC) ? 1U : 0U;
    pending_connect_valid_ = true;
    Bluefruit.Scanner.paused_ = true;
    return maybeConnectCentral();
  }

