lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  void handleCentralConnectionEvent(const BleConnectionEvent& event) {
    if (!(event.packetReceived && event.crcOk && event.attPacket && event.payload != nullptr &&
          event.payloadLength >= 7U)) {
      return;
    }

    const uint8_t attOpcode = event.payload[4];
    if (attOpcode != kAttOpHandleValueNtf) {
      return;
    }

    const uint16_t valueHandle = readLe16(&event.payload[5]);
    const uint16_t valueLength =
        (event.payloadLength >= 7U) ? static_cast<uint16_t>(event.payloadLength - 7U) : 0U;
    const uint8_t* value = &event.payload[7];
    for (uint8_t i = 0U; i < client_characteristic_count_; ++i) {
      BLEClientCharacteristic* characteristic = client_characteristics_[i];
      if (characteristic == nullptr || !characteristic->discovered_) {
        continue;
      }
      if (characteristic->value_handle_ == valueHandle) {
        characteristic->handleNotify(value, valueLength);
        return;
      }
    }
  }

  bool primeCentralConnectionBeforeUserCallback() {
    if (!radio_.isConnected() || radio_.connectionRole() != BleConnectionRole::kCentral) {
      return false;
    }

    const unsigned long startMs = millis();
    while (radio_.isConnected() && (millis() - startMs) < 250UL) {
      BleConnectionEvent event{};
      if (radio_.consumeDeferredConnectionEvent(&event) ||
          radio_.pollConnectionEvent(&event, 120000UL)) {
        handleCentralConnectionEvent(event);
        if (event.terminateInd) {
          return false;
        }
        if (event.eventStarted) {
          return true;
        }
      }
      yield();
    }

    return radio_.isConnected();
  }

  void idleService() {
    if (!started_) {
      return;
    }

    const bool connected = radio_.isConnected();
    if (connected != last_connected_) {
      handleConnectionEdge(connected);
      last_connected_ = connected;
    }

    if (!connected) {
      maybeAdvertise();
      maybeScanOrConnect();
    }

    if (connected) {
      const BleConnectionRole role = radio_.connectionRole();
      const bool centralForegroundSetupActive =
          (role == BleConnectionRole::kCentral) &&
          (central_connect_callback_pending_ || centralSyncProcedureActive());
      const bool backgroundReady =
          (role == BleConnectionRole::kPeripheral) ||
          (static_cast<int32_t>(millis() - last_connection_edge_ms_) >=
               static_cast<int32_t>(kBleNoWfiDuringSetupMs) &&
           !centralForegroundSetupActive);
      if (backgroundReady) {
        if (!radio_.isBackgroundConnectionServiceEnabled()) {
          radio_.setBackgroundConnectionServiceEnabled(true);
        }
      } else if (radio_.isBackgroundConnectionServiceEnabled()) {
        radio_.setBackgroundConnectionServiceEnabled(false);
      }

      maybeApplyDeferredConnectionRequests();
      maybeDispatchRssiUpdate();
      const bool foregroundConnectionPolling =
          !radio_.isBackgroundConnectionServiceEnabled();
      if (radio_.connectionRole() == BleConnectionRole::kPeripheral) {
        if (foregroundConnectionPolling) {
          for (uint8_t i = 0U; i < 2U && radio_.isConnected(); ++i) {
            BleConnectionEvent event{};
            if (!radio_.pollConnectionEvent(&event,
                                            kBleIdleConnectionPollBudgetUs)) {
              break;
            }
          }
        }
        maybeDispatchSecurityCallbacks();
        for (uint8_t i = 0U; i < characteristic_count_; ++i) {
          if (characteristics_[i] != nullptr) {
            characteristics_[i]->pollCccdState();
          }
        }
      } else if (radio_.connectionRole() == BleConnectionRole::kCentral) {
        maybeDispatchCentralConnectCallback();
        processCentralBackgroundEvents(4U);
        if (foregroundConnectionPolling) {
          for (uint8_t i = 0U; i < 2U && radio_.isConnected(); ++i) {
            BleConnectionEvent event{};
            if (!radio_.pollConnectionEvent(&event,
                                            kBleIdleConnectionPollBudgetUs)) {
              break;
            }
            handleCentralConnectionEvent(event);
          }
        }
        maybeDispatchSecurityCallbacks();
        dispatchDeferredUserCallbacks();
      }
    }
  }

  uint32_t idleSleepCapUs() const {
    if (!started_) {
      g_bluefruitBleIdleDiagLastIdleCapUs = 0U;
      return 0U;
    }

    if (centralSyncProcedureActive() || pending_connect_valid_) {
      const uint64_t nowUs = schedulerTimeUs();
      updateBleIdleDiagSnapshot(nowUs, kBluefruitBleIdleDiagStagePendingConnect,
                                1U);
      g_bluefruitBleIdleDiagLastIdleCapUs = 1U;
      return 1U;
    }
    if (!radio_.isConnected() &&
        Bluefruit.Scanner.running_ && !Bluefruit.Scanner.paused_ &&
        Bluefruit.Scanner.rx_callback_ != nullptr) {
      if (next_scan_due_us_ == 0U) {
        return 1U;
      }

      const uint64_t nowUs = schedulerTimeUs();
      if (timeReachedUs(nowUs, next_scan_due_us_)) {
        return 1U;
      }

      const uint64_t remainingUs64 = next_scan_due_us_ - nowUs;
      uint32_t remainingUs = (remainingUs64 > 0xFFFFFFFFULL)
                                 ? 0xFFFFFFFFUL
                                 : static_cast<uint32_t>(remainingUs64);
      const uint32_t wakeLeadUs =
          scan_prewarm_active_ ? kBleScannerReadyLeadUs
                               : kBleScannerPrewarmLeadUs;
      if (remainingUs > wakeLeadUs) {
        remainingUs -= wakeLeadUs;
      } else {
        remainingUs = 1U;
      }
      updateBleIdleDiagSnapshot(nowUs, kBluefruitBleIdleDiagStageScanSleeping,
                                remainingUs);
      g_bluefruitBleIdleDiagLastIdleCapUs = remainingUs;
      return remainingUs;
    }
    if (!radio_.isConnected() && radio_.isBackgroundAdvertisingEnabled()) {
      g_bluefruitBleIdleDiagLastIdleCapUs = 0U;
      return 0U;
    }
    if (!radio_.isConnected() && Bluefruit.Advertising.running_) {
      if (next_adv_due_us_ == 0U) {
        ++g_bluefruitIdleCapAdvZeroDueCount;
        return 1U;
      }

      const uint64_t nowUs = schedulerTimeUs();
      if (timeReachedUs(nowUs, next_adv_due_us_)) {
        ++g_bluefruitIdleCapAdvPastDueCount;
        return 1U;
      }

      const uint64_t remainingUs64 = next_adv_due_us_ - nowUs;
      uint32_t remainingUs = (remainingUs64 > 0xFFFFFFFFULL)
                                 ? 0xFFFFFFFFUL
                                 : static_cast<uint32_t>(remainingUs64);

      // Wake slightly ahead of the deadline so the pump-driven advertising
      // state machine can stage the next event without falling late.
      if (remainingUs > 500U) {
        remainingUs -= 500U;
      } else {
        ++g_bluefruitIdleCapAdvLeadBusyCount;
        remainingUs = 1U;
      }

