lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  void processCentralBackgroundEvents(uint8_t maxEvents) {
    maybeApplyCentralLinkConfig();
    for (uint8_t i = 0U; i < maxEvents; ++i) {
      BleConnectionEvent event{};
      if (!radio_.consumeDeferredConnectionEvent(&event)) {
        break;
      }
      handleCentralConnectionEvent(event);
    }
  }

  bool applyAdvertisingPayloads() {
    if (!radio_.setAdvertisingPduType(
            static_cast<xiao_nrf54l15::BleAdvPduType>(Bluefruit.Advertising.adv_type_))) {
      return false;
    }
    if (!radio_.setAdvertisingData(Bluefruit.Advertising.data_, Bluefruit.Advertising.len_)) {
      return false;
    }
    if (!radio_.setScanResponseData(Bluefruit.ScanResponse.data_, Bluefruit.ScanResponse.len_)) {
      return false;
    }
    Bluefruit.Advertising.dirty_ = false;
    Bluefruit.ScanResponse.dirty_ = false;
    return true;
  }

  void maybeAdvertise() {
    ++g_bluefruitMaybeAdvertiseCallCount;
    if (!Bluefruit.Advertising.running_) {
      if (radio_.isBackgroundAdvertisingEnabled()) {
        radio_.stopBackgroundAdvertising();
      }
      return;
    }

    if (Bluefruit.Advertising.stop_timeout_s_ != 0U) {
      const unsigned long elapsedMs = schedulerTimeMs() - adv_started_ms_;
      if (elapsedMs >= (static_cast<unsigned long>(Bluefruit.Advertising.stop_timeout_s_) *
                        1000UL)) {
        Bluefruit.Advertising.running_ = false;
        if (radio_.isBackgroundAdvertisingEnabled()) {
          radio_.stopBackgroundAdvertising();
        }
        if (Bluefruit.Advertising.stop_callback_ != nullptr) {
          invokeBluefruitUserCallback(Bluefruit.Advertising.stop_callback_);
        }
        return;
      }
    }

    if (Bluefruit.Advertising.dirty_ || Bluefruit.ScanResponse.dirty_) {
      if (!applyAdvertisingPayloads()) {
        return;
      }
      if (radio_.isBackgroundAdvertisingEnabled()) {
        radio_.stopBackgroundAdvertising();
      }
    }

    if (!radio_.serviceResolvablePrivateAddressRotation()) {
      return;
    }

    uint16_t intervalUnits = Bluefruit.Advertising.interval_fast_;
    if (Bluefruit.Advertising.fast_timeout_s_ != 0U) {
      const unsigned long elapsedMs = schedulerTimeMs() - adv_started_ms_;
      if (elapsedMs >= (static_cast<unsigned long>(Bluefruit.Advertising.fast_timeout_s_) *
                        1000UL)) {
        intervalUnits = (Bluefruit.Advertising.interval_slow_ != 0U)
                            ? Bluefruit.Advertising.interval_slow_
                            : Bluefruit.Advertising.interval_fast_;
      }
    }
    if (intervalUnits == 0U) {
      intervalUnits = 32U;
    }

    const uint8_t advType = Bluefruit.Advertising.adv_type_;
    if (advType == BLE_GAP_ADV_TYPE_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED) {
      if (radio_.isBackgroundAdvertisingEnabled()) {
        return;
      }

      bool backgroundStarted = false;
      {
        const uint32_t intervalUs = static_cast<uint32_t>(intervalUnits) * 625UL;
        if ((intervalUs % 1000UL) == 0UL) {
          const uint32_t intervalMs = intervalUs / 1000UL;
#if defined(NRF54L15_CLEAN_POWER_LOW)
          backgroundStarted = radio_.beginBackgroundAdvertising(
              intervalMs, xiao_nrf54l15::BleAdvertisingChannel::k37, 1200U,
              true, true);
#else
          backgroundStarted =
              radio_.beginBackgroundAdvertising3Channel(intervalMs, 350U, 1200U,
                                                        true);
#endif
        }
      }
      if (backgroundStarted) {
        return;
      }
    }

    const uint64_t nowUs = schedulerTimeUs();
    if (next_adv_due_us_ != 0U && !timeReachedUs(nowUs, next_adv_due_us_)) {
      ++g_bluefruitMaybeAdvertiseNotDueCount;
      return;
    }

    g_bluefruitMaybeAdvertiseIntervalUnitsLast = intervalUnits;
    if (intervalUnits < g_bluefruitMaybeAdvertiseIntervalUnitsMin) {
      g_bluefruitMaybeAdvertiseIntervalUnitsMin = intervalUnits;
    }
    if (intervalUnits > g_bluefruitMaybeAdvertiseIntervalUnitsMax) {
      g_bluefruitMaybeAdvertiseIntervalUnitsMax = intervalUnits;
    }

    const uint32_t intervalUs = static_cast<uint32_t>(intervalUnits) * 625UL;
    const uint32_t advDelayUs = foregroundAdvertisingRandomDelayUs();
    const uint64_t scheduledNextDueUs =
        nowUs + static_cast<uint64_t>(intervalUs) + advDelayUs;
    // Foreground advertising is pump-driven by the Arduino scheduler. Schedule
    // the BLE-spec random advertising delay here and call the radio with its
    // internal delay disabled, otherwise the core wakes at the interval
    // boundary and burns the whole random-delay window immediately before TX.
    next_adv_due_us_ = scheduledNextDueUs;

    if (advType == BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED ||
        advType == BLE_GAP_ADV_TYPE_NONCONNECTABLE_SCANNABLE_UNDIRECTED) {
      (void)radio_.advertiseInteractEvent(
          nullptr, kForegroundConnectableAdvInterChannelDelayUs, 250000UL,
          700000UL, false);
      ++g_bluefruitMaybeAdvertiseConnectableEventCount;
    } else {
      (void)radio_.advertiseEvent(350U, 600000UL, false);
      ++g_bluefruitMaybeAdvertiseNonconnEventCount;
    }

    ++g_bluefruitMaybeAdvertiseEventCount;
    if (g_bluefruitMaybeAdvertiseLastEventUs != 0ULL) {
      const uint64_t gapUs64 = nowUs - g_bluefruitMaybeAdvertiseLastEventUs;
      const uint32_t gapUs =
          (gapUs64 > 0xFFFFFFFFULL) ? 0xFFFFFFFFUL : static_cast<uint32_t>(gapUs64);
      g_bluefruitMaybeAdvertiseGapTotalUs += gapUs;
      if (gapUs < g_bluefruitMaybeAdvertiseGapMinUs) {
        g_bluefruitMaybeAdvertiseGapMinUs = gapUs;
      }
      if (gapUs > g_bluefruitMaybeAdvertiseGapMaxUs) {
        g_bluefruitMaybeAdvertiseGapMaxUs = gapUs;
      }
    }
    g_bluefruitMaybeAdvertiseLastEventUs = nowUs;
  }

  void maybeDispatchRssiUpdate() {
    if (!rssi_monitor_enabled_ || Bluefruit.rssi_callback_ == nullptr) {
      return;
    }

    int8_t currentRssiDbm = 0;
    if (!radio_.getLatestConnectionRssiDbm(&currentRssiDbm)) {
      return;
    }
    if (!last_reported_rssi_valid_) {
      last_reported_rssi_dbm_ = currentRssiDbm;
      last_reported_rssi_valid_ = true;
      return;
    }

    if (currentRssiDbm == last_reported_rssi_dbm_) {
      return;
    }

