lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
    const uint8_t threshold = rssi_monitor_threshold_;
    const int deltaDbm = abs(static_cast<int>(currentRssiDbm) -
                             static_cast<int>(last_reported_rssi_dbm_));
    if (threshold != 0xFFU && threshold != 0U &&
        deltaDbm < static_cast<int>(threshold)) {
      return;
    }

    last_reported_rssi_dbm_ = currentRssiDbm;
    invokeBluefruitUserCallback(Bluefruit.rssi_callback_, 0U, currentRssiDbm);
  }

  void maybeDispatchSecurityCallbacks() {
    if (!radio_.isConnected()) {
      return;
    }
    if (radio_.connectionRole() == BleConnectionRole::kCentral &&
        central_connect_callback_pending_) {
      return;
    }

    const bool encrypted = radio_.isConnectionEncrypted();
    const bool pairingActive = radio_.isPairingInProgress();
    const bool procedureActive = radio_.isSecurityProcedureActive();
    if (procedureActive) {
      security_seen_procedure_active_ = true;
    }
    if (pairingActive) {
      security_pairing_in_progress_ = true;
      security_secured_callback_pending_ = true;
    }

    uint8_t passkey[6] = {0};
    bool matchRequest = false;
    if (radio_.getPendingPairingPasskey(passkey, &matchRequest)) {
      bool accept = !matchRequest;
      if (Bluefruit.Security.pair_passkey_callback_ != nullptr) {
        ScopedBluefruitUserCallback scope;
        accept = Bluefruit.Security.pair_passkey_callback_(0U, passkey,
                                                           matchRequest);
      }
      (void)radio_.replyPendingPairingPasskey(accept);
      return;
    }

    uint8_t failureReason = 0U;
    if (radio_.consumePairingFailureReason(&failureReason)) {
      if (Bluefruit.Security.pair_complete_callback_ != nullptr) {
        invokeBluefruitUserCallback(Bluefruit.Security.pair_complete_callback_,
                                    0U, failureReason);
      }
      security_pairing_in_progress_ = false;
      security_secured_callback_pending_ = false;
      security_secured_callback_fired_ = false;
      security_seen_procedure_active_ = false;
      security_secured_callback_timeout_ms_ = 0UL;
      security_last_encrypted_ = encrypted;
      return;
    }

    if (security_secured_callback_pending_ &&
        !security_secured_callback_fired_ &&
        encrypted && !security_last_encrypted_ &&
        Bluefruit.Security.secured_callback_ != nullptr) {
      invokeBluefruitUserCallback(Bluefruit.Security.secured_callback_, 0U);
      security_secured_callback_fired_ = true;
      if (!security_pairing_in_progress_) {
        security_secured_callback_pending_ = false;
        security_seen_procedure_active_ = false;
        security_secured_callback_timeout_ms_ = 0UL;
      }
    }

    if (security_pairing_in_progress_ && !procedureActive) {
      if (encrypted &&
          !security_secured_callback_fired_ &&
          Bluefruit.Security.secured_callback_ != nullptr) {
        invokeBluefruitUserCallback(Bluefruit.Security.secured_callback_, 0U);
        security_secured_callback_fired_ = true;
      }
      if (Bluefruit.Security.pair_complete_callback_ != nullptr) {
        invokeBluefruitUserCallback(
            Bluefruit.Security.pair_complete_callback_, 0U,
            encrypted ? BLE_GAP_SEC_STATUS_SUCCESS : 0x08U);
      }
      security_pairing_in_progress_ = false;
      security_secured_callback_pending_ = false;
      security_secured_callback_fired_ = false;
      security_seen_procedure_active_ = false;
      security_secured_callback_timeout_ms_ = 0UL;
    } else if (!security_pairing_in_progress_ &&
               security_secured_callback_pending_ &&
               !security_secured_callback_fired_) {
      const bool timeoutReached =
          security_secured_callback_timeout_ms_ != 0UL &&
          static_cast<int32_t>(millis() - security_secured_callback_timeout_ms_) >= 0;
      if ((security_seen_procedure_active_ && !procedureActive) || timeoutReached) {
        if (Bluefruit.Security.secured_callback_ != nullptr) {
          invokeBluefruitUserCallback(Bluefruit.Security.secured_callback_, 0U);
        }
        security_secured_callback_pending_ = false;
        security_seen_procedure_active_ = false;
        security_secured_callback_timeout_ms_ = 0UL;
      }
    }

    security_last_encrypted_ = encrypted;
  }

  void handleConnectionEdge(bool connected) {
    if (connected) {
      ++g_bluefruitBleIdleDiagConnectionEdgeCount;
      last_connection_edge_ms_ = millis();
      g_bluefruitBleIdleDiagLastConnectionEdgeMs = last_connection_edge_ms_;
      connection_.handle_ = 0U;
      last_connection_role_ = radio_.connectionRole();
      g_bluefruitBleIdleDiagLastRole =
          static_cast<uint32_t>(last_connection_role_);
      clearCentralScannerTransientState();
      central_explicit_data_length_request_ = false;
      central_explicit_mtu_request_valid_ = false;
      central_explicit_requested_mtu_ = kDefaultAttMtu;
      rssi_monitor_enabled_ = false;
      rssi_monitor_threshold_ = 0xFFU;
      last_reported_rssi_dbm_ = 0;
      last_reported_rssi_valid_ = false;
      security_pairing_in_progress_ = false;
      security_secured_callback_pending_ = false;
      security_secured_callback_fired_ = false;
      security_seen_procedure_active_ = false;
      security_last_encrypted_ = radio_.isConnectionEncrypted();
      security_secured_callback_timeout_ms_ = 0UL;
      if (Bluefruit.auto_conn_led_) {
        digitalWrite(LED_BUILTIN, kLedOnState);
      }
      if (last_connection_role_ == BleConnectionRole::kPeripheral) {
        radio_.setBackgroundConnectionServiceEnabled(true);
        // restartOnDisconnect is a future policy; advertising is not active
        // while a peripheral connection is established.
        Bluefruit.Advertising.running_ = false;
        next_adv_due_us_ = 0U;
        nrf54l15_ble_idle_wake_cancel();
        armed_adv_wake_us_ = 0U;
        for (uint8_t i = 0U; i < characteristic_count_; ++i) {
          if (characteristics_[i] != nullptr) {
            characteristics_[i]->_notify_enabled = false;
            characteristics_[i]->_indicate_enabled = false;
          }
        }
        if (Bluefruit.Periph.connect_callback_ != nullptr) {
          invokeBluefruitUserCallback(Bluefruit.Periph.connect_callback_, 0U);
        }
        // Dispatch CCCD=0 callback on each characteristic so sketches
        // reset their notifyenableFlag before the main loop body runs.
        for (uint8_t i = 0U; i < characteristic_count_; ++i) {
          BLECharacteristic* c = characteristics_[i];
          if (c != nullptr && c->_cccd_wr_cb != nullptr) {
            invokeBluefruitUserCallback(c->_cccd_wr_cb, 0U, c,
                                        static_cast<uint16_t>(0U));
          }
        }
      } else if (last_connection_role_ == BleConnectionRole::kCentral) {
        Bluefruit.Scanner.paused_ = true;
        central_data_length_request_pending_ = Bluefruit.central_request_data_length_;
        central_mtu_request_pending_ = Bluefruit.central_request_mtu_;
        central_link_config_not_before_ms_ = millis() + 1000UL;
        central_connect_callback_pending_ = false;
        central_connect_callback_not_before_ms_ = 0UL;
        if (Bluefruit.Central.connect_callback_ != nullptr &&
            primeCentralConnectionBeforeUserCallback()) {
          central_connect_callback_pending_ = true;
          central_connect_callback_not_before_ms_ = millis() + 2000UL;
        }
        if (radio_.hasBondRecord()) {
          security_secured_callback_pending_ = true;
          security_secured_callback_timeout_ms_ = millis() + 2500UL;
        }
      }
      return;
    }

    ++g_bluefruitBleIdleDiagConnectionEdgeCount;
    ++g_bluefruitBleIdleDiagDisconnectEdgeCount;
    last_connection_edge_ms_ = millis();
    g_bluefruitBleIdleDiagLastConnectionEdgeMs = last_connection_edge_ms_;
    g_bluefruitBleIdleDiagLastRole =
        static_cast<uint32_t>(last_connection_role_);
    g_bluefruitBleIdleDiagStage = kBluefruitBleIdleDiagStageDisconnectEdge;
    radio_.setBackgroundConnectionServiceEnabled(false);
    nrf54l15_ble_background_radio_release();
    BleDisconnectDebug debug{};
    uint8_t reason = 0x13U;
    if (radio_.getDisconnectDebug(&debug)) {
      reason = disconnectReasonToHci(debug);
    }
    g_bluefruitBleIdleDiagLastDisconnectReason = reason;
    rssi_monitor_enabled_ = false;
    rssi_monitor_threshold_ = 0xFFU;
    last_reported_rssi_dbm_ = 0;
    last_reported_rssi_valid_ = false;
    security_pairing_in_progress_ = false;
    security_secured_callback_pending_ = false;
    security_secured_callback_fired_ = false;
    security_seen_procedure_active_ = false;
    security_last_encrypted_ = false;
    security_secured_callback_timeout_ms_ = 0UL;
    deferred_connection_phy_request_pending_ = false;
    deferred_connection_data_length_request_pending_ = false;
    deferred_connection_mtu_request_pending_ = false;
    deferred_connection_requested_phy_ = BLE_GAP_PHY_AUTO;
    deferred_connection_requested_mtu_ = kDefaultAttMtu;
    deferred_connection_phy_next_ms_ = 0UL;
    deferred_connection_data_length_next_ms_ = 0UL;
    deferred_connection_mtu_next_ms_ = 0UL;
    deferred_connection_phy_attempts_ = 0U;
    deferred_connection_data_length_attempts_ = 0U;
    deferred_connection_mtu_attempts_ = 0U;
    central_connect_callback_pending_ = false;
    central_connect_callback_not_before_ms_ = 0UL;
    connection_.handle_ = INVALID_CONNECTION_HANDLE;
    if (last_connection_role_ == BleConnectionRole::kPeripheral) {
      for (uint8_t i = 0U; i < characteristic_count_; ++i) {
        if (characteristics_[i] != nullptr) {
          const bool hadNotify = characteristics_[i]->_notify_enabled;
          const bool hadIndicate = characteristics_[i]->_indicate_enabled;
          characteristics_[i]->_notify_enabled = false;
          characteristics_[i]->_indicate_enabled = false;
          if ((hadNotify || hadIndicate) && characteristics_[i]->_cccd_wr_cb != nullptr) {
            invokeBluefruitUserCallback(characteristics_[i]->_cccd_wr_cb, 0U,
                                        characteristics_[i], 0U);
          }
        }
      }
    }
    if (Bluefruit.auto_conn_led_) {
      digitalWrite(LED_BUILTIN, kLedOffState);
    }
    if (last_connection_role_ == BleConnectionRole::kPeripheral) {
      if (Bluefruit.Periph.disconnect_callback_ != nullptr) {
        invokeBluefruitUserCallback(Bluefruit.Periph.disconnect_callback_, 0U, reason);
      }
      if (Bluefruit.Advertising.restart_on_disconnect_) {
        Bluefruit.Advertising.running_ = true;
        adv_started_ms_ = schedulerTimeMs();
        next_adv_due_us_ = 0U;
        nrf54l15_ble_idle_wake_cancel();
        armed_adv_wake_us_ = 0U;
        adv_random_state_ = 0U;
      }
    } else if (last_connection_role_ == BleConnectionRole::kCentral) {
      clearCentralScannerTransientState();
      resetScannerSchedule();
      central_data_length_request_pending_ = false;
      central_mtu_request_pending_ = false;
      central_explicit_data_length_request_ = false;
      central_explicit_mtu_request_valid_ = false;
      central_explicit_requested_mtu_ = kDefaultAttMtu;
      central_link_config_not_before_ms_ = 0UL;
      if (Bluefruit.Central.disconnect_callback_ != nullptr) {
        invokeBluefruitUserCallback(Bluefruit.Central.disconnect_callback_, 0U, reason);
      }
      if (Bluefruit.Scanner.restart_on_disconnect_) {
        Bluefruit.Scanner.running_ = true;
        next_scan_due_us_ = 0U;
        if (Bluefruit.Scanner.low_power_after_ms_ != 0U) {
          Bluefruit.Scanner.started_ms_ =
              millis() - Bluefruit.Scanner.low_power_after_ms_;
        } else {
          Bluefruit.Scanner.started_ms_ = millis();
        }
        Bluefruit.Scanner.paused_ = false;
      }
    }
    last_connection_role_ = BleConnectionRole::kNone;
  }
};

