lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
BluefruitCompatManager& manager() {
  static BluefruitCompatManager instance;
  return instance;
}

extern "C" uint8_t nrf54l15_clean_ble_idle_yield_wfi_allowed(void) {
  return manager().idleYieldWfiAllowed() ? 1U : 0U;
}

BLESecurity::BLESecurity()
    : secured_callback_(nullptr),
      pair_passkey_callback_(nullptr),
      pair_complete_callback_(nullptr),
      io_caps_(0x03U),
      fixed_pin_valid_(false),
      fixed_pin_{0},
      oob_enabled_(false),
      oob_local_valid_(false),
      oob_remote_valid_(false),
      oob_local_r_{0},
      oob_local_c_{0},
      oob_remote_r_{0},
      oob_remote_c_{0},
      oob_data_request_callback_(nullptr),
      resolving_list_count_(0),
      resolving_list_irks_{{0}} {}

void BLESecurity::setSecuredCallback(secured_callback_t fp) {
  secured_callback_ = fp;
}

void BLESecurity::setPairPasskeyCallback(pair_passkey_callback_t fp) {
  pair_passkey_callback_ = fp;
}

void BLESecurity::setPairCompleteCallback(pair_complete_callback_t fp) {
  pair_complete_callback_ = fp;
}

void BLESecurity::setIOCaps(uint8_t ioCaps) {
  if (ioCaps > 0x04U) {
    ioCaps = 0x03U;
  }
  io_caps_ = ioCaps;
  manager().radio().setSecurityIoCapabilities(ioCaps);
}

void BLESecurity::setIOCaps(bool display, bool yesNo, bool keyboard) {
  uint8_t ioCaps = 0x03U;
  if (display && keyboard) {
    ioCaps = 0x04U;
  } else if (keyboard) {
    ioCaps = 0x02U;
  } else if (display && yesNo) {
    ioCaps = 0x01U;
  } else if (display) {
    ioCaps = 0x00U;
  }
  setIOCaps(ioCaps);
}

void BLESecurity::setPIN(const char* pin) {
  fixed_pin_valid_ = false;
  memset(fixed_pin_, 0, sizeof(fixed_pin_));
  manager().radio().setSecurityFixedPasskey(nullptr);
  if (pin == nullptr || strlen(pin) != 6U) {
    return;
  }
  for (size_t i = 0; i < 6U; ++i) {
    if (pin[i] < '0' || pin[i] > '9') {
      return;
    }
    fixed_pin_[i] = pin[i];
  }
  fixed_pin_[6] = '\0';
  fixed_pin_valid_ = true;
  manager().radio().setSecurityFixedPasskey(fixed_pin_);
  if (io_caps_ == 0x03U) {
    setIOCaps(0x00U);
  }
}

bool BLESecurity::generateOobData(uint8_t oob_r[16], uint8_t oob_c[16]) {
  if (oob_r == nullptr || oob_c == nullptr) return false;
  if (!manager().radio().generateSecurityOobData(oob_r, oob_c)) return false;
  memcpy(oob_local_r_, oob_r, 16);
  memcpy(oob_local_c_, oob_c, 16);
  oob_local_valid_ = true;
  oob_enabled_ = true;
  return true;
}

bool BLESecurity::setOobData(const uint8_t oob_r[16], const uint8_t oob_c[16]) {
  if (oob_r == nullptr || oob_c == nullptr) return false;
  memcpy(oob_local_r_, oob_r, 16);
  memcpy(oob_local_c_, oob_c, 16);
  oob_local_valid_ = true;
  oob_enabled_ = true;
  manager().radio().setSecurityOobEnabled(true);
  manager().radio().setSecurityOobLocalData(oob_r, oob_c);
  return true;
}

bool BLESecurity::setOobRemoteData(const uint8_t oob_r[16], const uint8_t oob_c[16]) {
  if (oob_r == nullptr || oob_c == nullptr) return false;
  memcpy(oob_remote_r_, oob_r, 16);
  memcpy(oob_remote_c_, oob_c, 16);
  oob_remote_valid_ = true;
  oob_enabled_ = true;
  manager().radio().setSecurityOobRemoteData(oob_r, oob_c);
  return true;
}

bool BLESecurity::getOobData(uint8_t oob_r[16], uint8_t oob_c[16]) const {
  if (!oob_local_valid_) return false;
  memcpy(oob_r, oob_local_r_, 16);
  memcpy(oob_c, oob_local_c_, 16);
  return true;
}

bool BLESecurity::getOobRemoteData(uint8_t oob_r[16], uint8_t oob_c[16]) const {
  if (!oob_remote_valid_) return false;
  memcpy(oob_r, oob_remote_r_, 16);
  memcpy(oob_c, oob_remote_c_, 16);
  return true;
}

bool BLESecurity::setOobFlag(bool enable) {
  oob_enabled_ = enable;
  manager().radio().setSecurityOobEnabled(enable);
  return true;
}

bool BLESecurity::requestPairing() const {
  return manager().radio().requestPairing();
}

bool BLESecurity::getLocalIdentityRoot(uint8_t irk[16]) const {
  if (irk == nullptr) return false;
  xiao_nrf54l15::Ficr::identityRoot(irk);
  return true;
}

bool BLESecurity::generateResolvablePrivateAddress(const uint8_t irk[16],
                                                   uint8_t addressOut[6]) const {
  return manager().radio().generateResolvablePrivateAddress(irk, addressOut);
}

bool BLESecurity::setResolvablePrivateAddress(const uint8_t irk[16],
                                              uint8_t addressOut[6]) const {
  return manager().radio().setResolvablePrivateAddress(irk, addressOut);
}

bool BLESecurity::enableResolvablePrivateAddressRotation(
    uint32_t intervalMs, bool rotateNow, uint8_t addressOut[6]) const {
  uint8_t irk[16] = {};
  if (!getLocalIdentityRoot(irk)) {
    return false;
  }
  return enableResolvablePrivateAddressRotation(irk, intervalMs, rotateNow,
                                                addressOut);
}

bool BLESecurity::enableResolvablePrivateAddressRotation(
    const uint8_t irk[16], uint32_t intervalMs, bool rotateNow,
    uint8_t addressOut[6]) const {
  return manager().radio().enableResolvablePrivateAddressRotation(
      irk, intervalMs, rotateNow, addressOut);
}

void BLESecurity::disableResolvablePrivateAddressRotation() const {
  manager().radio().disableResolvablePrivateAddressRotation();
}

bool BLESecurity::serviceResolvablePrivateAddressRotation(
    uint8_t addressOut[6]) const {
  return manager().radio().serviceResolvablePrivateAddressRotation(addressOut);
}

bool BLESecurity::resolvablePrivateAddressRotationEnabled() const {
  return manager().radio().isResolvablePrivateAddressRotationEnabled();
}

bool BLESecurity::resolveResolvablePrivateAddress(const uint8_t address[6],
                                                  const uint8_t* irks,
                                                  size_t irkCount,
                                                  bool* outResolved,
                                                  uint16_t* outIndex) const {
  return manager().radio().resolveResolvablePrivateAddress(address, irks,
                                                           irkCount,
                                                           outResolved,
                                                           outIndex);
}

void BLESecurity::clearResolvingList() {
  resolving_list_count_ = 0U;
  memset(resolving_list_irks_, 0, sizeof(resolving_list_irks_));
}

