lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
void BLECharacteristic::setCccdWriteCallback(write_cccd_cb_t fp, bool useAdaCallback) {
  (void)useAdaCallback;
  _cccd_wr_cb = fp;
}

void BLECharacteristic::setReadAuthorizeCallback(read_authorize_cb_t fp, bool useAdaCallback) {
  (void)useAdaCallback;
  _rd_authorize_cb = fp;
}

void BLECharacteristic::setWriteAuthorizeCallback(write_authorize_cb_t fp,
                                                  bool useAdaCallback) {
  (void)useAdaCallback;
  _wr_authorize_cb = fp;
}

err_t BLECharacteristic::begin() {
  if (!manager().begin(1U, 0U)) {
    return ERROR_INVALID_STATE;
  }
  if (_handles.value_handle != 0U) {
    return ERROR_NONE;
  }

  _service = BLEService::lastService;
  if (_service == nullptr || !_service->_begun) {
    return ERROR_INVALID_STATE;
  }

  uint16_t valueHandle = 0U;
  uint16_t cccdHandle = 0U;
  const uint8_t initialLen = clampValueLen(_value_len);
  const uint8_t properties = mapProperties(_properties);
  bool ok = false;
  if (uuid.size() == 2U) {
    ok = manager().radio().addCustomGattCharacteristic(
        _service->_handle, uuid.uuid16(), properties, _value, initialLen, &valueHandle,
        &cccdHandle);
  } else if (uuid.size() == 16U) {
    ok = manager().radio().addCustomGattCharacteristic128(
        _service->_handle, uuid.uuid128(), properties, _value, initialLen, &valueHandle,
        &cccdHandle);
  }
  if (!ok) {
    return ERROR_INVALID_STATE;
  }

  _handles.value_handle = valueHandle;
  _handles.decl_handle = (valueHandle > 0U) ? static_cast<uint16_t>(valueHandle - 1U) : 0U;
  _handles.cccd_handle = cccdHandle;
  if (!manager().registerCharacteristic(this)) {
    return ERROR_NO_MEM;
  }
  return ERROR_NONE;
}

ble_gatts_char_handles_t BLECharacteristic::handles() const { return _handles; }

uint16_t BLECharacteristic::write(const void* data, uint16_t len) {
  if (data == nullptr && len > 0U) {
    return 0U;
  }
  const uint8_t toWrite = clampValueLen((_fixed_len && _max_len > 0U) ? _max_len : len);
  memset(_value, 0, sizeof(_value));
  if (data != nullptr && toWrite > 0U) {
    memcpy(_value, data, min<uint8_t>(toWrite, clampValueLen(len)));
  }
  _value_len = toWrite;
  if (_userbuf != nullptr && _userbufsize > 0U) {
    const uint16_t copied = min<uint16_t>(_userbufsize, _value_len);
    memcpy(_userbuf, _value, copied);
  }
  if (_handles.value_handle != 0U) {
    manager().radio().setCustomGattCharacteristicValue(_handles.value_handle, _value, _value_len);
  }
  return _value_len;
}

uint16_t BLECharacteristic::write(const char* str) {
  return write(str, (str != nullptr) ? static_cast<uint16_t>(strlen(str)) : 0U);
}

uint16_t BLECharacteristic::write8(uint8_t num) { return write(&num, sizeof(num)); }

uint16_t BLECharacteristic::write16(uint16_t num) { return write(&num, sizeof(num)); }

uint16_t BLECharacteristic::write32(uint32_t num) { return write(&num, sizeof(num)); }

uint16_t BLECharacteristic::write32(int num) { return write(&num, sizeof(num)); }

uint16_t BLECharacteristic::writeFloat(float num) { return write(&num, sizeof(num)); }

uint16_t BLECharacteristic::read(void* buffer, uint16_t bufsize, uint16_t offset) {
  if (buffer == nullptr || bufsize == 0U) {
    return 0U;
  }
  if (_handles.value_handle != 0U) {
    uint8_t len = sizeof(_value);
    if (manager().radio().getCustomGattCharacteristicValue(_handles.value_handle, _value, &len)) {
      _value_len = len;
    }
  }
  if (offset >= _value_len) {
    return 0U;
  }
  const uint16_t toCopy = min<uint16_t>(bufsize, static_cast<uint16_t>(_value_len - offset));
  memcpy(buffer, &_value[offset], toCopy);
  return toCopy;
}

uint8_t BLECharacteristic::read8() {
  uint8_t value = 0U;
  read(&value, sizeof(value));
  return value;
}

uint16_t BLECharacteristic::read16() {
  uint16_t value = 0U;
  read(&value, sizeof(value));
  return value;
}

uint32_t BLECharacteristic::read32() {
  uint32_t value = 0UL;
  read(&value, sizeof(value));
  return value;
}

float BLECharacteristic::readFloat() {
  float value = 0.0f;
  read(&value, sizeof(value));
  return value;
}

uint16_t BLECharacteristic::getCccd(uint16_t conn_hdl) {
  (void)conn_hdl;
  uint16_t value = 0U;
  if (notifyEnabled()) {
    value |= 0x0001U;
  }
  if (indicateEnabled()) {
    value |= 0x0002U;
  }
  return value;
}

bool BLECharacteristic::notifyEnabled() { return notifyEnabled(0U); }

bool BLECharacteristic::notifyEnabled(uint16_t conn_hdl) {
  (void)conn_hdl;
  return (_handles.value_handle != 0U) &&
         manager().radio().isCustomGattCccdEnabled(_handles.value_handle, false);
}

bool BLECharacteristic::notify(const void* data, uint16_t len) {
  return notify(0U, data, len);
}

bool BLECharacteristic::notify(const char* str) {
  return notify(0U, str, (str != nullptr) ? static_cast<uint16_t>(strlen(str)) : 0U);
}

bool BLECharacteristic::notify8(uint8_t num) { return notify(&num, sizeof(num)); }

bool BLECharacteristic::notify16(uint16_t num) { return notify(&num, sizeof(num)); }

bool BLECharacteristic::notify32(uint32_t num) { return notify(&num, sizeof(num)); }

bool BLECharacteristic::notify32(int num) { return notify(&num, sizeof(num)); }

bool BLECharacteristic::notify32(float num) { return notify(&num, sizeof(num)); }

bool BLECharacteristic::notify(uint16_t conn_hdl, const void* data, uint16_t len) {
  (void)conn_hdl;
  if (_handles.value_handle == 0U) {
    return false;
  }
  const uint16_t written = write(data, len);
  if (len > 0U && written == 0U) {
    return false;
  }
  return manager().radio().notifyCustomGattCharacteristic(_handles.value_handle, false);
}

bool BLECharacteristic::notify(uint16_t conn_hdl, const char* str) {
  return notify(conn_hdl, str, (str != nullptr) ? static_cast<uint16_t>(strlen(str)) : 0U);
}

bool BLECharacteristic::notify8(uint16_t conn_hdl, uint8_t num) {
  return notify(conn_hdl, &num, sizeof(num));
}

bool BLECharacteristic::notify16(uint16_t conn_hdl, uint16_t num) {
  return notify(conn_hdl, &num, sizeof(num));
}

bool BLECharacteristic::notify32(uint16_t conn_hdl, uint32_t num) {
  return notify(conn_hdl, &num, sizeof(num));
}

