lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
bool BLECharacteristic::notify32(uint16_t conn_hdl, int num) {
  return notify(conn_hdl, &num, sizeof(num));
}

bool BLECharacteristic::notify32(uint16_t conn_hdl, float num) {
  return notify(conn_hdl, &num, sizeof(num));
}

bool BLECharacteristic::indicateEnabled() { return indicateEnabled(0U); }

bool BLECharacteristic::indicateEnabled(uint16_t conn_hdl) {
  (void)conn_hdl;
  return (_handles.value_handle != 0U) &&
         manager().radio().isCustomGattCccdEnabled(_handles.value_handle, true);
}

bool BLECharacteristic::indicate(const void* data, uint16_t len) {
  return indicate(0U, data, len);
}

bool BLECharacteristic::indicate(const char* str) {
  return indicate(0U, str, (str != nullptr) ? static_cast<uint16_t>(strlen(str)) : 0U);
}

bool BLECharacteristic::indicate8(uint8_t num) { return indicate(&num, sizeof(num)); }

bool BLECharacteristic::indicate16(uint16_t num) { return indicate(&num, sizeof(num)); }

bool BLECharacteristic::indicate32(uint32_t num) { return indicate(&num, sizeof(num)); }

bool BLECharacteristic::indicate32(int num) { return indicate(&num, sizeof(num)); }

bool BLECharacteristic::indicate32(float num) { return indicate(&num, sizeof(num)); }

bool BLECharacteristic::indicate(uint16_t conn_hdl, const void* data, uint16_t len) {
  (void)conn_hdl;
  if (_handles.value_handle == 0U ||
      manager().radio().isCustomGattNotificationQueued(_handles.value_handle, true)) {
    return false;
  }
  const uint16_t written = write(data, len);
  if (len > 0U && written == 0U) {
    return false;
  }
  return manager().radio().notifyCustomGattCharacteristic(_handles.value_handle, true);
}

bool BLECharacteristic::indicate(uint16_t conn_hdl, const char* str) {
  return indicate(conn_hdl, str, (str != nullptr) ? static_cast<uint16_t>(strlen(str)) : 0U);
}

bool BLECharacteristic::indicate8(uint16_t conn_hdl, uint8_t num) {
  return indicate(conn_hdl, &num, sizeof(num));
}

bool BLECharacteristic::indicate16(uint16_t conn_hdl, uint16_t num) {
  return indicate(conn_hdl, &num, sizeof(num));
}

bool BLECharacteristic::indicate32(uint16_t conn_hdl, uint32_t num) {
  return indicate(conn_hdl, &num, sizeof(num));
}

bool BLECharacteristic::indicate32(uint16_t conn_hdl, int num) {
  return indicate(conn_hdl, &num, sizeof(num));
}

bool BLECharacteristic::indicate32(uint16_t conn_hdl, float num) {
  return indicate(conn_hdl, &num, sizeof(num));
}

void BLECharacteristic::handleWriteFromRadio(const uint8_t* data, uint16_t len) {
  const uint8_t toCopy = clampValueLen(len);
  memset(_value, 0, sizeof(_value));
  if (data != nullptr && toCopy > 0U) {
    memcpy(_value, data, toCopy);
  }
  _value_len = toCopy;
  if (_userbuf != nullptr && _userbufsize > 0U) {
    const uint16_t copied = min<uint16_t>(_userbufsize, _value_len);
    memcpy(_userbuf, _value, copied);
  }
  if (_wr_cb != nullptr) {
    invokeBluefruitUserCallback(_wr_cb, 0U, this, _value, _value_len);
  }
}

void BLECharacteristic::pollCccdState() {
  if (_handles.value_handle == 0U || _cccd_wr_cb == nullptr) {
    return;
  }
  const bool notify = manager().radio().isCustomGattCccdEnabled(_handles.value_handle, false);
  const bool indicate = manager().radio().isCustomGattCccdEnabled(_handles.value_handle, true);
  if (notify == _notify_enabled && indicate == _indicate_enabled) {
    return;
  }
  _notify_enabled = notify;
  _indicate_enabled = indicate;
  uint16_t cccd = 0U;
  if (notify) {
    cccd |= 0x0001U;
  }
  if (indicate) {
    cccd |= 0x0002U;
  }
  invokeBluefruitUserCallback(_cccd_wr_cb, 0U, this, cccd);
}

BLEAdvertisingData::BLEAdvertisingData(bool scan_response)
    : data_{0}, len_(0U), scan_response_(scan_response), dirty_(true) {}

void BLEAdvertisingData::clearData() {
  memset(data_, 0, sizeof(data_));
  len_ = 0U;
  dirty_ = true;
}

bool BLEAdvertisingData::setData(const uint8_t* data, uint8_t len) {
  if ((data == nullptr && len > 0U) || len > sizeof(data_)) {
    return false;
  }
  memset(data_, 0, sizeof(data_));
  if (len > 0U) {
    memcpy(data_, data, len);
  }
  len_ = len;
  dirty_ = true;
  return true;
}

bool BLEAdvertisingData::addData(uint8_t type, const void* data, uint8_t len) {
  if ((data == nullptr && len > 0U) || (len_ + len + 2U) > sizeof(data_)) {
    return false;
  }
  data_[len_++] = static_cast<uint8_t>(len + 1U);
  data_[len_++] = type;
  if (len > 0U) {
    memcpy(&data_[len_], data, len);
    len_ = static_cast<uint8_t>(len_ + len);
  }
  dirty_ = true;
  return true;
}

bool BLEAdvertisingData::addFlags(uint8_t flags) { return addData(kAdTypeFlags, &flags, 1U); }

bool BLEAdvertisingData::addTxPower() {
  const int8_t txPower = Bluefruit.getTxPower();
  return addData(kAdTypeTxPower, &txPower, 1U);
}

bool BLEAdvertisingData::addName() {
  char name[CFG_MAX_DEVNAME_LEN + 1] = {0};
  const uint8_t nameLen = Bluefruit.getName(name, sizeof(name));
  if (nameLen == 0U) {
    return false;
  }
  const uint8_t maxLen = static_cast<uint8_t>((sizeof(data_) > (len_ + 2U))
                                                  ? (sizeof(data_) - len_ - 2U)
                                                  : 0U);
  if (maxLen == 0U) {
    return false;
  }
  const uint8_t actualLen = (nameLen > maxLen) ? maxLen : nameLen;
  const uint8_t type = (actualLen == nameLen) ? kAdTypeCompleteName : kAdTypeShortName;
  return addData(type, name, actualLen);
}

bool BLEAdvertisingData::addAppearance(uint16_t appearance) {
  return addData(kAdTypeAppearance, &appearance, sizeof(appearance));
}

bool BLEAdvertisingData::addManufacturerData(const void* data, uint8_t len) {
  return addData(kAdTypeManufacturer, data, len);
}

bool BLEAdvertisingData::addService(const BLEService& service) { return addService(service.uuid); }

bool BLEAdvertisingData::addService(const BLEClientService& service) {
  return addService(service.uuid);
}

bool BLEAdvertisingData::addService(const BLEService& service1, const BLEService& service2) {
  return addService(service1) && addService(service2);
}

bool BLEAdvertisingData::addService(const BLEService& service1, const BLEService& service2,
                                    const BLEService& service3) {
  return addService(service1) && addService(service2) && addService(service3);
}

bool BLEAdvertisingData::addService(const BLEService& service1, const BLEService& service2,
                                    const BLEService& service3,
                                    const BLEService& service4) {
  return addService(service1) && addService(service2) && addService(service3) &&
         addService(service4);
}

bool BLEAdvertisingData::addService(const BLEUuid& uuid) { return addUuid(uuid); }

