lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
bool BLEAdvertisingData::addUuid(const BLEUuid& uuid) {
  if (uuid.size() == 2U) {
    const uint16_t uuid16 = uuid.uuid16();
    return addData(kAdTypeComplete16, &uuid16, sizeof(uuid16));
  }
  if (uuid.size() == 16U) {
    return addData(kAdTypeComplete128, uuid.uuid128(), 16U);
  }
  return false;
}

bool BLEAdvertisingData::addUuid(const BLEUuid& uuid1, const BLEUuid& uuid2) {
  return addUuid(uuid1) && addUuid(uuid2);
}

bool BLEAdvertisingData::addUuid(const BLEUuid& uuid1, const BLEUuid& uuid2,
                                 const BLEUuid& uuid3) {
  return addUuid(uuid1) && addUuid(uuid2) && addUuid(uuid3);
}

bool BLEAdvertisingData::addUuid(const BLEUuid& uuid1, const BLEUuid& uuid2,
                                 const BLEUuid& uuid3, const BLEUuid& uuid4) {
  return addUuid(uuid1) && addUuid(uuid2) && addUuid(uuid3) && addUuid(uuid4);
}

bool BLEAdvertisingData::addUuid(const BLEUuid uuids[], uint8_t count) {
  if (uuids == nullptr) {
    return false;
  }
  for (uint8_t i = 0U; i < count; ++i) {
    if (!addUuid(uuids[i])) {
      return false;
    }
  }
  return true;
}

uint8_t BLEAdvertisingData::count() const { return len_; }

uint8_t* BLEAdvertisingData::getData() { return data_; }

BLEAdvertising::BLEAdvertising()
    : BLEAdvertisingData(false),
      restart_on_disconnect_(true),
      interval_fast_(32U),
      interval_slow_(244U),
      fast_timeout_s_(30U),
      stop_timeout_s_(0U),
      adv_type_(static_cast<uint8_t>(xiao_nrf54l15::BleAdvPduType::kAdvInd)),
      running_(false),
      slow_callback_(nullptr),
      stop_callback_(nullptr) {}

void BLEAdvertising::restartOnDisconnect(bool enable) { restart_on_disconnect_ = enable; }

void BLEAdvertising::setInterval(uint16_t fast, uint16_t slow) {
  interval_fast_ = fast;
  interval_slow_ = slow;
}

void BLEAdvertising::setIntervalMS(uint16_t fast_ms, uint16_t slow_ms) {
  setInterval(MS1000TO625(fast_ms), (slow_ms == 0U) ? 0U : MS1000TO625(slow_ms));
}

void BLEAdvertising::setFastTimeout(uint16_t seconds) { fast_timeout_s_ = seconds; }

void BLEAdvertising::setType(uint8_t type) { adv_type_ = type; }

void BLEAdvertising::setSlowCallback(slow_callback_t cb) { slow_callback_ = cb; }

void BLEAdvertising::setStopCallback(stop_callback_t cb) { stop_callback_ = cb; }

uint16_t BLEAdvertising::getInterval() const { return interval_fast_; }

bool BLEAdvertising::setBeacon(BLEBeacon& beacon) { return beacon.start(*this); }

bool BLEAdvertising::setBeacon(EddyStoneUrl& beacon) { return beacon.start(*this); }

bool BLEAdvertising::start(uint16_t timeout) {
  if (!manager().begin(1U, 0U)) {
    return false;
  }
  stop_timeout_s_ = timeout;
  running_ = true;
  manager().markAdvertisingDirty();
  manager().advertisingStarted();
  return true;
}

bool BLEAdvertising::stop() {
  running_ = false;
  manager().radio().stopBackgroundAdvertising();
  return true;
}

bool BLEAdvertising::isRunning() const { return running_; }

BLEBeacon::BLEBeacon() { reset(); }

BLEBeacon::BLEBeacon(const uint8_t uuid128[16]) {
  reset();
  setUuid(uuid128);
}

BLEBeacon::BLEBeacon(const uint8_t uuid128[16], uint16_t major, uint16_t minor, int8_t rssi) {
  reset();
  setUuid(uuid128);
  setMajorMinor(major, minor);
  setRssiAt1m(rssi);
}

void BLEBeacon::reset() {
  manufacturer_ = kCompanyIdApple;
  memset(uuid128_, 0, sizeof(uuid128_));
  uuid_valid_ = false;
  major_be_ = 0U;
  minor_be_ = 0U;
  rssi_at_1m_ = -54;
}

void BLEBeacon::setManufacturer(uint16_t manufacturer) { manufacturer_ = manufacturer; }

void BLEBeacon::setUuid(const uint8_t uuid128[16]) {
  if (uuid128 == nullptr) {
    memset(uuid128_, 0, sizeof(uuid128_));
    uuid_valid_ = false;
    return;
  }
  memcpy(uuid128_, uuid128, sizeof(uuid128_));
  uuid_valid_ = true;
}

void BLEBeacon::setMajorMinor(uint16_t major, uint16_t minor) {
  major_be_ = byteSwap16(major);
  minor_be_ = byteSwap16(minor);
}

void BLEBeacon::setRssiAt1m(int8_t rssi) { rssi_at_1m_ = rssi; }

bool BLEBeacon::start() { return start(Bluefruit.Advertising); }

bool BLEBeacon::start(BLEAdvertising& adv) {
  if (!uuid_valid_) {
    return false;
  }

  struct {
    uint16_t manufacturer;
    uint8_t beacon_type;
    uint8_t beacon_len;
    uint8_t uuid128[16];
    uint16_t major;
    uint16_t minor;
    int8_t rssi_at_1m;
  } payload{};

  payload.manufacturer = manufacturer_;
  payload.beacon_type = 0x02U;
  payload.beacon_len = 21U;
  memcpy(payload.uuid128, uuid128_, sizeof(payload.uuid128));
  payload.major = major_be_;
  payload.minor = minor_be_;
  payload.rssi_at_1m = rssi_at_1m_;

  adv.clearData();
  return adv.addFlags(BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE) &&
         adv.addData(BLE_GAP_AD_TYPE_MANUFACTURER_SPECIFIC_DATA, &payload,
                     sizeof(payload));
}

namespace {

constexpr const char* kEddystonePrefixes[] = {
    "http://www.",
    "https://www.",
    "http://",
    "https://",
};

constexpr const char* kEddystoneExpansions[] = {
    ".com/",
    ".org/",
    ".edu/",
    ".net/",
    ".info/",
    ".biz/",
    ".gov/",
    ".com",
    ".org",
    ".edu",
    ".net",
    ".info",
    ".biz",
    ".gov",
};

const char* findEddystoneExpansion(const char* url, uint8_t* index) {
  if (url == nullptr || index == nullptr) {
    return nullptr;
  }
  for (uint8_t i = 0U; i < (sizeof(kEddystoneExpansions) / sizeof(kEddystoneExpansions[0]));
       ++i) {
    const char* match = strstr(url, kEddystoneExpansions[i]);
    if (match != nullptr) {
      *index = i;
      return match;
    }
  }
  return nullptr;
}

}  // namespace

EddyStoneUrl::EddyStoneUrl() : rssi_(0), url_(nullptr) {}

EddyStoneUrl::EddyStoneUrl(int8_t rssiAt0m, const char* url) : rssi_(rssiAt0m), url_(url) {}

void EddyStoneUrl::setUrl(const char* url) { url_ = url; }

void EddyStoneUrl::setRssi(int8_t rssiAt0m) { rssi_ = rssiAt0m; }

bool EddyStoneUrl::start() { return start(Bluefruit.Advertising); }

bool EddyStoneUrl::start(BLEAdvertising& adv) {
  if (url_ == nullptr) {
    return false;
  }

