lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
const BLEClientService& BLEClientCharacteristic::parentService() const { return *service_; }

void BLEClientCharacteristic::resetDiscovery() {
  discovered_ = false;
  conn_handle_ = INVALID_CONNECTION_HANDLE;
  decl_handle_ = 0U;
  value_handle_ = 0U;
  end_handle_ = 0U;
  cccd_handle_ = 0U;
  properties_ = 0U;
  last_value_len_ = 0U;
}

bool BLEClientCharacteristic::discover(uint16_t conn_hdl) {
  if (!begin() || service_ == nullptr || !service_->discover(conn_hdl)) {
    resetDiscovery();
    return false;
  }
  return discover();
}

bool BLEClientCharacteristic::discover() {
  if (!begin() || service_ == nullptr || !service_->discovered_) {
    resetDiscovery();
    return false;
  }

  resetDiscovery();
  if (!retryCentralProcedure([&]() {
        return discoverCharacteristicSync(service_->start_handle_, service_->end_handle_,
                                          uuid, &decl_handle_, &value_handle_,
                                          &end_handle_, &properties_);
      })) {
    return false;
  }
  conn_handle_ = service_->conn_handle_;
  discovered_ = true;
  return true;
}

uint16_t BLEClientCharacteristic::read(void* buffer, uint16_t len) {
  if (!discovered_ || buffer == nullptr || len == 0U) {
    return 0U;
  }
  uint8_t scratch[sizeof(last_value_)] = {0};
  const uint16_t readLen = readHandleSync(value_handle_, scratch, sizeof(scratch));
  if (readLen == 0U) {
    return 0U;
  }
  last_value_len_ =
      static_cast<uint8_t>(min<uint16_t>(readLen, sizeof(last_value_)));
  memcpy(last_value_, scratch, last_value_len_);
  const uint16_t copyLen = min<uint16_t>(len, readLen);
  memcpy(buffer, scratch, copyLen);
  return copyLen;
}

uint8_t BLEClientCharacteristic::read8() {
  uint8_t value = 0U;
  (void)read(&value, sizeof(value));
  return value;
}

uint16_t BLEClientCharacteristic::write(const void* buffer, uint16_t len) {
  const bool supportsWrite =
      (properties_ & xiao_nrf54l15::kBleGattPropWrite) != 0U;
  const bool supportsWriteWithoutResponse =
      (properties_ & xiao_nrf54l15::kBleGattPropWriteNoRsp) != 0U;
  const bool withResponse = supportsWrite || !supportsWriteWithoutResponse;
  return write(buffer, len, withResponse);
}

uint16_t BLEClientCharacteristic::write(const void* buffer, uint16_t len,
                                        bool withResponse) {
  if (!discovered_ || buffer == nullptr || len == 0U ||
      len > BleRadio::kCustomGattMaxValueLength) {
    return 0U;
  }
  if (!waitForLinkValueCapacity(len)) {
    return 0U;
  }
  return writeHandleSync(value_handle_, static_cast<const uint8_t*>(buffer), len,
                         withResponse) ? len
                                       : 0U;
}

uint16_t BLEClientCharacteristic::writeWithoutResponse(const void* buffer,
                                                       uint16_t len) {
  return write(buffer, len, false);
}

uint16_t BLEClientCharacteristic::write8(uint8_t value) {
  return write(&value, sizeof(value));
}

uint16_t BLEClientCharacteristic::write8(uint8_t value, bool withResponse) {
  return write(&value, sizeof(value), withResponse);
}

uint16_t BLEClientCharacteristic::write8WithoutResponse(uint8_t value) {
  return writeWithoutResponse(&value, sizeof(value));
}

bool BLEClientCharacteristic::enableNotify() {
  if (!discovered_) {
    return false;
  }
  if (cccd_handle_ == 0U &&
      !retryCentralProcedure([&]() {
        return discoverCccdHandleSync(value_handle_, end_handle_, &cccd_handle_);
      })) {
    return false;
  }
  const uint8_t cccdValue[2] = {0x01U, 0x00U};
  return retryCentralProcedure([&]() {
    return writeHandleSync(cccd_handle_, cccdValue, sizeof(cccdValue), true);
  });
}

bool BLEClientCharacteristic::disableNotify() {
  if (!discovered_) {
    return false;
  }
  if (cccd_handle_ == 0U &&
      !retryCentralProcedure([&]() {
        return discoverCccdHandleSync(value_handle_, end_handle_, &cccd_handle_);
      })) {
    return false;
  }
  const uint8_t cccdValue[2] = {0x00U, 0x00U};
  return retryCentralProcedure([&]() {
    return writeHandleSync(cccd_handle_, cccdValue, sizeof(cccdValue), true);
  });
}

void BLEClientCharacteristic::handleNotify(const uint8_t* data, uint16_t len) {
  const uint8_t copyLen = min<uint16_t>(len, sizeof(last_value_));
  if (copyLen > 0U && data != nullptr) {
    memcpy(last_value_, data, copyLen);
  }
  last_value_len_ = copyLen;
  if (notify_callback_ != nullptr) {
    pending_notify_callback_ = true;
  }
}

void BLEClientCharacteristic::dispatchPendingNotify() {
  if (!pending_notify_callback_ || notify_callback_ == nullptr) {
    return;
  }
  pending_notify_callback_ = false;
  invokeBluefruitUserCallback(notify_callback_, this, last_value_, last_value_len_);
}

BLEClientService::BLEClientService()
    : uuid(),
      begun_(false),
      discovered_(false),
      conn_handle_(INVALID_CONNECTION_HANDLE),
      start_handle_(0U),
      end_handle_(0U) {}

BLEClientService::BLEClientService(BLEUuid bleuuid)
    : BLEClientService() {
  uuid = bleuuid;
}

bool BLEClientService::begin() {
  if (!manager().begin(0U, 1U)) {
    return false;
  }
  begun_ = true;
  lastService = this;
  return true;
}

void BLEClientService::resetDiscovery() {
  discovered_ = false;
  conn_handle_ = INVALID_CONNECTION_HANDLE;
  start_handle_ = 0U;
  end_handle_ = 0U;
}

bool BLEClientService::discover(uint16_t conn_hdl) {
  resetDiscovery();
  if ((!begun_ && !begin()) || !centralReady(conn_hdl)) {
    return false;
  }
  // Drain any queued link-setup TX (DLE, MTU, PHY) before attempting
  // ATT service discovery, otherwise the ATT request backs up behind it.
  manager().radio().forceClearPendingTx();
  if (!retryCentralProcedure([&]() {
        return discoverServiceRangeSync(uuid, &start_handle_, &end_handle_);
      })) {
    return false;
  }
  conn_handle_ = conn_hdl;
  discovered_ = true;
  lastService = this;
  return true;
}

BLEClientUart* BLEClientUart::instances_[BLEClientUart::kMaxInstances] = {};
uint8_t BLEClientUart::instance_count_ = 0U;

BLEClientUart::BLEClientUart()
    : service_(BLEUART_UUID_SERVICE),
      txd_(BLEUART_UUID_CHR_TXD),
      rxd_(BLEUART_UUID_CHR_RXD),
      discovered_(false),
      rx_callback_(nullptr),
      rx_fifo_{0},
      rx_head_(0U),
      rx_tail_(0U),
      rx_count_(0U) {
  if (instance_count_ < kMaxInstances) {
    instances_[instance_count_++] = this;
  }
}

bool BLEClientUart::begin() {
  txd_.setNotifyCallback(txdNotifyThunk);
  return service_.begin() && txd_.begin(&service_) && rxd_.begin(&service_);
}

bool BLEClientUart::discover(uint16_t conn_hdl) {
  discovered_ = false;
  rx_head_ = 0U;
  rx_tail_ = 0U;
  rx_count_ = 0U;
  if (!begin() || !service_.discover(conn_hdl) || !txd_.discover() || !rxd_.discover()) {
    return false;
  }
  discovered_ = true;
  return true;
}

