lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
err_t BLEUart::begin() {
  const err_t status = BLEService::begin();
  if (status != ERROR_NONE) {
    return status;
  }

  _txd.setProperties(CHR_PROPS_NOTIFY);
  _txd.setPermission(SECMODE_OPEN, SECMODE_NO_ACCESS);
  _txd.setMaxLen(BleRadio::kCustomGattMaxValueLength);
  _txd.setCccdWriteCallback(bleuart_txd_cccd_cb);
  if (_txd.begin() != ERROR_NONE) {
    return ERROR_INVALID_STATE;
  }

  _rxd.setProperties(CHR_PROPS_WRITE | CHR_PROPS_WRITE_WO_RESP);
  _rxd.setPermission(SECMODE_NO_ACCESS, SECMODE_OPEN);
  _rxd.setMaxLen(BleRadio::kCustomGattMaxValueLength);
  _rxd.setWriteCallback(bleuart_rxd_cb);
  if (_rxd.begin() != ERROR_NONE) {
    return ERROR_INVALID_STATE;
  }

  return ERROR_NONE;
}

bool BLEUart::notifyEnabled() { return _txd.notifyEnabled(); }

bool BLEUart::notifyEnabled(uint16_t conn_hdl) { return _txd.notifyEnabled(conn_hdl); }

void BLEUart::setRxCallback(rx_callback_t fp, bool deferred) {
  (void)deferred;
  _rx_cb = fp;
}

void BLEUart::setRxOverflowCallback(rx_overflow_callback_t fp) { _overflow_cb = fp; }

void BLEUart::setNotifyCallback(notify_callback_t fp) { _notify_cb = fp; }

void BLEUart::bufferTXD(bool enable) { _tx_buffered = enable; }

bool BLEUart::flushTXD() { return flushTXD(0U); }

bool BLEUart::flushTXD(uint16_t conn_hdl) {
  (void)conn_hdl;
  return true;
}

uint8_t BLEUart::read8() { return static_cast<uint8_t>(read()); }

uint16_t BLEUart::read16() {
  uint16_t value = 0U;
  read(reinterpret_cast<uint8_t*>(&value), sizeof(value));
  return value;
}

uint32_t BLEUart::read32() {
  uint32_t value = 0UL;
  read(reinterpret_cast<uint8_t*>(&value), sizeof(value));
  return value;
}

int BLEUart::read() {
  if (_rx_count == 0U) {
    return -1;
  }
  const int value = _rx_fifo[_rx_tail];
  _rx_tail = static_cast<uint16_t>((_rx_tail + 1U) % _rx_fifo_depth);
  --_rx_count;
  return value;
}

int BLEUart::read(uint8_t* buf, size_t size) {
  if (buf == nullptr || size == 0U) {
    return 0;
  }
  size_t copied = 0U;
  while (copied < size) {
    const int ch = read();
    if (ch < 0) {
      break;
    }
    buf[copied++] = static_cast<uint8_t>(ch);
  }
  return static_cast<int>(copied);
}

size_t BLEUart::write(uint8_t b) { return write(0U, &b, 1U); }

size_t BLEUart::write(const uint8_t* content, size_t len) { return write(0U, content, len); }

size_t BLEUart::write(uint16_t conn_hdl, uint8_t b) { return write(conn_hdl, &b, 1U); }

size_t BLEUart::write(uint16_t conn_hdl, const uint8_t* content, size_t len) {
  BLEConnection* conn = Bluefruit.Connection(conn_hdl);
  if (conn == nullptr || content == nullptr || len == 0U || !notifyEnabled(conn_hdl)) {
    return 0U;
  }

  size_t sent = 0U;
  uint32_t stalledAtMs = 0U;
  while (sent < len) {
    const uint16_t mtu = conn->getMtu();
    const uint16_t maxChunk =
        (mtu > 3U) ? static_cast<uint16_t>(mtu - 3U) : 20U;
    const uint16_t chunk =
        min<uint16_t>(min<uint16_t>(BleRadio::kCustomGattMaxValueLength, maxChunk),
                      static_cast<uint16_t>(len - sent));
    if (_txd.notify(conn_hdl, &content[sent], chunk)) {
      sent += chunk;
      stalledAtMs = 0U;
      continue;
    }

    if (!Bluefruit.connected() || !notifyEnabled(conn_hdl)) {
      break;
    }

    if (stalledAtMs == 0U) {
      stalledAtMs = millis();
    } else if ((millis() - stalledAtMs) > 1000UL) {
      break;
    }

    yield();
  }
  return sent;
}

int BLEUart::available() { return _rx_count; }

int BLEUart::peek() {
  if (_rx_count == 0U) {
    return -1;
  }
  return _rx_fifo[_rx_tail];
}

void BLEUart::flush() {}

void BLEUart::handleRx(uint16_t conn_hdl, const uint8_t* data, uint16_t len) {
  uint16_t dropped = 0U;
  for (uint16_t i = 0U; i < len; ++i) {
    if (_rx_count >= _rx_fifo_depth) {
      ++dropped;
      continue;
    }
    _rx_fifo[_rx_head] = data[i];
    _rx_head = static_cast<uint16_t>((_rx_head + 1U) % _rx_fifo_depth);
    ++_rx_count;
  }
  if (dropped > 0U && _overflow_cb != nullptr) {
    invokeBluefruitUserCallback(_overflow_cb, conn_hdl, dropped);
  }
  if (_rx_cb != nullptr) {
    invokeBluefruitUserCallback(_rx_cb, conn_hdl);
  }
}

void BLEUart::bleuart_rxd_cb(uint16_t conn_hdl, BLECharacteristic* chr, uint8_t* data,
                             uint16_t len) {
  auto& service = static_cast<BLEUart&>(chr->parentService());
  service.handleRx(conn_hdl, data, len);
}

void BLEUart::bleuart_txd_cccd_cb(uint16_t conn_hdl, BLECharacteristic* chr, uint16_t value) {
  auto& service = static_cast<BLEUart&>(chr->parentService());
  if (service._notify_cb != nullptr) {
    invokeBluefruitUserCallback(service._notify_cb, conn_hdl, (value & 0x0001U) != 0U);
  }
}

AdafruitBluefruit::AdafruitBluefruit()
    : Periph(),
      Central(),
      Security(),
      Gatt(),
      Advertising(),
      ScanResponse(true),
      Scanner(),
      Discovery(),
      device_name_{0},
      tx_power_(0),
      appearance_(0),
      auto_conn_led_(false),
      conn_led_interval_ms_(500UL),
      periph_requested_mtu_(23U),
      central_conn_interval_(24U),
      central_supervision_timeout_(200U),
      central_requested_mtu_(23U),
      central_request_data_length_(false),
      central_request_mtu_(false),
      rssi_callback_(nullptr) {
  strncpy(device_name_, "XIAO nRF54L15", sizeof(device_name_) - 1U);
}

void AdafruitBluefruit::configServiceChanged(bool changed) { (void)changed; }

void AdafruitBluefruit::configUuid128Count(uint8_t uuid128_max) { (void)uuid128_max; }

void AdafruitBluefruit::configAttrTableSize(uint32_t attr_table_size) {
  (void)attr_table_size;
}

static void applyPeripheralConnHint(BLEPeriph& periph, uint16_t mtu_max,
                                    uint16_t event_len) {
  uint16_t min_interval = 24U;
  uint16_t max_interval = 40U;

  if (mtu_max >= 247U || event_len >= 100U) {
    min_interval = 6U;
    max_interval = 12U;
  } else if (mtu_max >= 128U || event_len >= 6U) {
    min_interval = 12U;
    max_interval = 24U;
  } else if (event_len <= 2U) {
    min_interval = 40U;
    max_interval = 80U;
  }

  periph.setConnInterval(min_interval, max_interval);
  periph.setConnSlaveLatency(0U);
  periph.setConnSupervisionTimeout(500U);
}

static uint16_t preferredBleDataLengthFromMtu(uint16_t mtu_max) {
  uint16_t requested_mtu = mtu_max;
  if (requested_mtu < 23U) {
    requested_mtu = 23U;
  } else if (requested_mtu > 247U) {
    requested_mtu = 247U;
  }

  uint16_t payload_length = static_cast<uint16_t>(requested_mtu + 4U);
  if (payload_length < 27U) {
    payload_length = 27U;
  } else if (payload_length > 251U) {
    payload_length = 251U;
  }
  return payload_length;
}

void AdafruitBluefruit::configPrphConn(uint16_t mtu_max, uint16_t event_len,
                                       uint8_t hvn_qsize, uint8_t wrcmd_qsize) {
  (void)hvn_qsize;
  (void)wrcmd_qsize;
  uint16_t requested_mtu = mtu_max;
  if (requested_mtu < 23U) {
    requested_mtu = 23U;
  } else if (requested_mtu > 247U) {
    requested_mtu = 247U;
  }
  periph_requested_mtu_ = requested_mtu;
  manager().radio().setPeripheralPreferredAttMtu(requested_mtu);
  manager().radio().setPeripheralPreferredDataLength(
      preferredBleDataLengthFromMtu(requested_mtu));
  applyPeripheralConnHint(Periph, mtu_max, event_len);
}

void AdafruitBluefruit::configCentralConn(uint16_t mtu_max, uint16_t event_len,
                                          uint8_t hvn_qsize, uint8_t wrcmd_qsize) {
  (void)hvn_qsize;
  (void)wrcmd_qsize;

  uint16_t interval_units = 24U;
  if (mtu_max >= 247U || event_len >= 100U) {
    interval_units = 6U;
  } else if (mtu_max >= 128U || event_len >= 6U) {
    interval_units = 12U;
  } else if (event_len <= 2U) {
    interval_units = 40U;
  }

  uint16_t requested_mtu = mtu_max;
  if (requested_mtu < 23U) {
    requested_mtu = 23U;
  } else if (requested_mtu > 247U) {
    requested_mtu = 247U;
  }

  central_conn_interval_ = interval_units;
  central_supervision_timeout_ = 40U;  // 400ms, minimize link-loss spike
  central_requested_mtu_ = requested_mtu;
  manager().radio().setCentralPreferredAttMtu(requested_mtu);
  manager().radio().setCentralPreferredDataLength(
      preferredBleDataLengthFromMtu(requested_mtu));
  central_request_mtu_ = (requested_mtu > 23U);
  central_request_data_length_ =
      (requested_mtu > 23U) || (event_len >= 6U);
}

void AdafruitBluefruit::configPrphBandwidth(uint8_t bw) {
  switch (bw) {
    case BANDWIDTH_LOW:
      configPrphConn(23U, 2U, 1U, 1U);
      break;

    case BANDWIDTH_AUTO:
    case BANDWIDTH_NORMAL:
      configPrphConn(23U, 3U, 1U, 1U);
      break;

    case BANDWIDTH_HIGH:
      configPrphConn(128U, 6U, 2U, 1U);
      break;

    case BANDWIDTH_MAX:
      configPrphConn(247U, 100U, 3U, 1U);
      break;

    default:
      break;
  }
}

void AdafruitBluefruit::configCentralBandwidth(uint8_t bw) {
  switch (bw) {
    case BANDWIDTH_LOW:
      configCentralConn(23U, 2U, 1U, 1U);
      break;

    case BANDWIDTH_AUTO:
    case BANDWIDTH_NORMAL:
      configCentralConn(23U, 3U, 1U, 1U);
      break;

    case BANDWIDTH_HIGH:
      configCentralConn(128U, 6U, 2U, 1U);
      break;

    case BANDWIDTH_MAX:
      configCentralConn(247U, 100U, 3U, 1U);
      break;

    default:
      break;
  }
}

bool AdafruitBluefruit::begin(uint8_t prph_count, uint8_t central_count) {
  bool ok = manager().begin(prph_count, central_count);
  // manager().begin() already handles serial bridge recovery
  return ok;
}

ble_gap_addr_t AdafruitBluefruit::getAddr() {
  ble_gap_addr_t gap_addr{};
  xiao_nrf54l15::BleAddressType type = xiao_nrf54l15::BleAddressType::kPublic;
  if (manager().radio().getDeviceAddress(gap_addr.addr, &type)) {
    gap_addr.addr_type = bluefruitAddressTypeFromHal(type, gap_addr.addr);
  }
  return gap_addr;
}

uint8_t AdafruitBluefruit::getAddr(uint8_t mac[6]) {
  if (mac == nullptr) {
    return BLE_GAP_ADDR_TYPE_PUBLIC;
  }

  ble_gap_addr_t gap_addr = getAddr();
  memcpy(mac, gap_addr.addr, sizeof(gap_addr.addr));
  return gap_addr.addr_type;
}

bool AdafruitBluefruit::setAddr(ble_gap_addr_t* gap_addr) {
  if (gap_addr == nullptr) {
    return false;
  }

  const xiao_nrf54l15::BleAddressType type =
      halAddressTypeFromBluefruit(gap_addr->addr_type);
  return manager().radio().setDeviceAddress(gap_addr->addr, type);
}

